# Retrieving single columns and rows

In [1]:
import numpy as np
 
# Read the dataset, select only first 5 rows
import pandas as pd
df = pd.read_csv('weather.csv').head()
df

FileNotFoundError: [Errno 2] File b'weather.csv' does not exist: b'weather.csv'

In [ ]:
# Selecting a single column
df['TEMP']

In [3]:
# On the result, we can use another index to retrieve a row
df['TEMP'][1]

5.7999999999999998

In [4]:
# Don't use this -- it's bad practice. Use df['TEMP']
df.TEMP

0    6.8
1    5.8
2    5.7
3    6.0
4    4.5
Name: TEMP, dtype: float64

In [5]:
# Transpose: swap rows/columns
dft = df.T
dft

                0        1        2        3        4
MONTH         1.0      1.0      1.0      1.0      1.0
DAY           1.0      1.0      1.0      1.0      1.0
TIME          1.0      2.0      3.0      4.0      5.0
TEMP          6.8      5.8      5.7      6.0      4.5
PRESSURE  10207.0  10214.0  10220.0  10225.0  10230.0

In [6]:
# Again, retrieve a column by its label - in this case column labels are ints
# Then retrieve the row by label
dft[2]['TIME']

3.0

In [7]:
# Rows can also be retrieved by position (not true for columns)
dft[2][2]

3.0

In [8]:
t = pd.DataFrame([['John'], ['Bob'], ['Anne']], index=[4,3,4])
t

      0
4  John
3   Bob
4  Anne

In [9]:
# There are 2 rows with label 4 
# Index has type int, so 4 is a label, not a position
t[0][4]

4    John
4    Anne
Name: 0, dtype: object

# Indexing with lists and slices

In [10]:
df

   MONTH  DAY  TIME  TEMP  PRESSURE
0      1    1     1   6.8     10207
1      1    1     2   5.8     10214
2      1    1     3   5.7     10220
3      1    1     4   6.0     10225
4      1    1     5   4.5     10230

In [11]:
# Retrieving multiple columns in any order
# Note the double square brackets
df[['PRESSURE', 'TIME', 'TEMP']]

   PRESSURE  TIME  TEMP
0     10207     1   6.8
1     10214     2   5.8
2     10220     3   5.7
3     10225     4   6.0
4     10230     5   4.5

In [12]:
# Retrieving multiple rows in any order
# Note the double square brackets
df['TIME'][[3,1,4]]

3    4
1    2
4    5
Name: TIME, dtype: int64

In [13]:
# Using a slice always selects rows
# Then we use a list to retrieve multiple columns
# Note the double square brackets
df[2:4][['TEMP', 'PRESSURE']]

   TEMP  PRESSURE
2   5.7     10220
3   6.0     10225

In [14]:
# Similar operation on the transposed dataset
dft[3:][[2,3]]

                2        3
TEMP          5.7      6.0
PRESSURE  10220.0  10225.0

In [15]:
# Retrieving a column, then using a slice to get rows
df['PRESSURE'][:4]

0    10207
1    10214
2    10220
3    10225
Name: PRESSURE, dtype: int64

In [16]:
# Again, we can get to rows both by position and label
# This select the first two rows even though the index is of type string
dft[:2]

         0    1    2    3    4
MONTH  1.0  1.0  1.0  1.0  1.0
DAY    1.0  1.0  1.0  1.0  1.0

In [56]:
# We can also use slices with strings
# If the index is of type string
dft['TIME':'PRESSURE']

                0        1        2        3        4
TIME          1.0      2.0      3.0      4.0      5.0
TEMP          6.8      5.8      5.7      6.0      4.5
PRESSURE  10207.0  10214.0  10220.0  10225.0  10230.0

# Using loc and iloc

In [18]:
capitals = pd.DataFrame(
    [
    ["Ngerulmud",391,1.87],
    ["Vatican City",826,100],
    ["Yaren",1100,10.91],
    ["Funafuti",4492,45.48],
    ["City of San Marino",4493]
    ], 
    index = ["Palau", "Vatican City", "Nauru", "Tuvalu", "San Marino"],
    columns=['Capital', 'Population', 'Percentage'])

In [19]:
capitals

                         Capital  Population  Percentage
Palau                  Ngerulmud         391        1.87
Vatican City        Vatican City         826      100.00
Nauru                      Yaren        1100       10.91
Tuvalu                  Funafuti        4492       45.48
San Marino    City of San Marino        4493         NaN

In [20]:
# Loc does row-based indexing
# And allows to select both row and column in 1 operation
capitals.loc['Nauru', 'Population']

1100

In [21]:
# Getting the same data without loc
capitals['Population']['Nauru']

1100

In [22]:
# loc works with lists and slices as well
capitals.loc['Palau':'Nauru', ['Population', 'Percentage']]

              Population  Percentage
Palau                391        1.87
Vatican City         826      100.00
Nauru               1100       10.91

In [23]:
# Leaving out the column selects all columns
capitals.loc[['San Marino', 'Vatican City']]

                         Capital  Population  Percentage
San Marino    City of San Marino        4493         NaN
Vatican City        Vatican City         826       100.0

In [24]:
# iloc works similar to loc, but with positions instead of labels
capitals.iloc[[4,1], 1:]

              Population  Percentage
San Marino          4493         NaN
Vatican City         826       100.0

In [25]:
# With iloc we can do something we couldn't do before:
# Retrieve a column by position
capitals.iloc[:,2]

Palau             1.87
Vatican City    100.00
Nauru            10.91
Tuvalu           45.48
San Marino         NaN
Name: Percentage, dtype: float64

# Boolean Filtering

In [26]:
# Indexing with a 'regular' list retrieves columns
capitals[['Capital', 'Population']]

                         Capital  Population
Palau                  Ngerulmud         391
Vatican City        Vatican City         826
Nauru                      Yaren        1100
Tuvalu                  Funafuti        4492
San Marino    City of San Marino        4493

In [27]:
# But indexing with boolean list retrieves rows
# Condition: the list has to contain as many elements as there are rows
capitals[[True, True, False, True, False]]

                   Capital  Population  Percentage
Palau            Ngerulmud         391        1.87
Vatican City  Vatican City         826      100.00
Tuvalu            Funafuti        4492       45.48

In [28]:
# Comparing a series to a value gives a list of booleans
capitals['Percentage'] > 25

Palau           False
Vatican City     True
Nauru           False
Tuvalu           True
San Marino      False
Name: Percentage, dtype: bool

In [29]:
# So we can use this list of booleans as an index
# To retrieve only the rows for which the comparison is True
capitals[capitals['Percentage'] > 25]

                   Capital  Population  Percentage
Vatican City  Vatican City         826      100.00
Tuvalu            Funafuti        4492       45.48

In [30]:
grades = pd.DataFrame([[6, 4], [7, 8], [6, 7], [6, 5], [5, 2]], 
                       index = ['Mary', 'John', 'Ann', 'Pete', 'Laura'],
                       columns = ['test_1', 'test_2'])
grades

       test_1  test_2
Mary        6       4
John        7       8
Ann         6       7
Pete        6       5
Laura       5       2

In [31]:
# We can compare across columns
grades['test_2'] <= grades['test_1']

Mary      True
John     False
Ann      False
Pete      True
Laura     True
dtype: bool

In [32]:
# And again, use that as input for the index operator
grades[grades['test_2'] <= grades['test_1']]

       test_1  test_2
Mary        6       4
Pete        6       5
Laura       5       2

In [33]:
# And you can use lists of booleans with loc and iloc too
grades.loc[:, grades.mean() > 5.5]

       test_1
Mary        6
John        7
Ann         6
Pete        6
Laura       5

# Assigning values

In [34]:
grades

       test_1  test_2
Mary        6       4
John        7       8
Ann         6       7
Pete        6       5
Laura       5       2

In [35]:
# We can assign new values to the data we have selected with an index
grades.loc[['Laura', 'John'], 'test_2'] += 1

In [36]:
grades

       test_1  test_2
Mary        6       4
John        7       9
Ann         6       7
Pete        6       5
Laura       5       3

In [37]:
# Updating an entire column
grades['test_1'] += .5
grades

       test_1  test_2
Mary      6.5       4
John      7.5       9
Ann       6.5       7
Pete      6.5       5
Laura     5.5       3

In [38]:
# Or an entire row
grades.loc['Mary'] += 2
grades

       test_1  test_2
Mary      8.5     6.0
John      7.5     9.0
Ann       6.5     7.0
Pete      6.5     5.0
Laura     5.5     3.0

In [39]:
# Or setting multiple values at once
grades.loc['Pete'] = [7,8]
grades

       test_1  test_2
Mary      8.5     6.0
John      7.5     9.0
Ann       6.5     7.0
Pete      7.0     8.0
Laura     5.5     3.0

In [40]:
# If necessary, we first save the boolean lists to variables
failing = grades < 6
passing = grades >= 6
grades[failing] = "Fail"
grades[passing] = "Pass"
grades

      test_1 test_2
Mary    Pass   Pass
John    Pass   Pass
Ann     Pass   Pass
Pete    Pass   Pass
Laura   Fail   Fail

In [41]:
grades = pd.DataFrame([[6, 4], [7, 8], [6, 7], [6, 5], [5, 2]], 
                      index = ['Mary', 'John', 'Ann', 'Pete', 'Laura'],
                      columns = ['test_1', 'test_2'])
grades

       test_1  test_2
Mary        6       4
John        7       8
Ann         6       7
Pete        6       5
Laura       5       2

In [42]:
# Creating a new column is simple
grades['passed'] = grades.mean(axis=1) > 6

In [43]:
grades

       test_1  test_2  passed
Mary        6       4   False
John        7       8    True
Ann         6       7    True
Pete        6       5   False
Laura       5       2   False

In [57]:
# But watch out - this creates a column by mistake!
grades['Ann', 'test_2'] = 8
grades

       test_1  test_2  passed  (Ann, test_2)
Mary        6       4   False              8
John        7       8    True              8
Ann         6       9    True              8
Pete        6       5   False              8
Laura       5       2   False              8

In [58]:
# This is a better way to do this
grades.loc['Ann', 'test_2'] = 8
grades

       test_1  test_2  passed  (Ann, test_2)
Mary        6       4   False              8
John        7       8    True              8
Ann         6       8    True              8
Pete        6       5   False              8
Laura       5       2   False              8

In [46]:
# This is called 'chained indexing' and assignment is not guarantueed to work
# Using loc is preferred
grades['test_2']['Ann'] = 9

/home/reindert/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

# Sorting

In [48]:
# Sort by index
# This returns a copy of the data
capitals.sort_index()

                         Capital  Population  Percentage
Nauru                      Yaren        1100       10.91
Palau                  Ngerulmud         391        1.87
San Marino    City of San Marino        4493         NaN
Tuvalu                  Funafuti        4492       45.48
Vatican City        Vatican City         826      100.00

In [51]:
# To change the original data: use inplace=True
# To sort in reverse, use ascending=False
capitals.sort_index(inplace=True, ascending=False)
capitals

                         Capital  Population  Percentage
Vatican City        Vatican City         826      100.00
Tuvalu                  Funafuti        4492       45.48
San Marino    City of San Marino        4493         NaN
Palau                  Ngerulmud         391        1.87
Nauru                      Yaren        1100       10.91

In [52]:
# To sort rows instead of columns, use axis=1
capitals.sort_index(axis=1)

                         Capital  Percentage  Population
Vatican City        Vatican City      100.00         826
Tuvalu                  Funafuti       45.48        4492
San Marino    City of San Marino         NaN        4493
Palau                  Ngerulmud        1.87         391
Nauru                      Yaren       10.91        1100

In [54]:
# sort_values sorts by data values
# It needs the argument 'by': which column to sort by
capitals.sort_values(by='Percentage')

                         Capital  Population  Percentage
Palau                  Ngerulmud         391        1.87
Nauru                      Yaren        1100       10.91
Tuvalu                  Funafuti        4492       45.48
Vatican City        Vatican City         826      100.00
San Marino    City of San Marino        4493         NaN

In [55]:
# Or you can sort by multiple columns
grades.sort_values(by=['test_1', 'test_2'])

       test_1  test_2  passed  (Ann, test_2)
Laura       5       2   False              8
Mary        6       4   False              8
Pete        6       5   False              8
Ann         6       9    True              8
John        7       8    True              8